#!/usr/bin/python
# -*- coding:utf8 -*-
print ("初始化")
code_dict = {
    'A': '.-',
    'B': '-...',
    'C': '-.-.',
    'D': '-..',
    'E': '.',
    'F': '..-.',
    'G': '--.',
    'H': '....',
    'I': '..',
    'J': '.---',
    'K': '-.-',
    'L': '.-..',
    'M': '--',
    'N': '-.',
    'O': '---',
    'P': '.--.',
    'Q': '--.-',
    'R': '.-.',
    'S': '...',
    'T': '-',
    'U': '..-',
    'V': '...-',
    'W': '.--',
    'X': '-..-',
    'Y': '-.--',
    'Z': '--..',
    '0': '-----',
    '1': '.----',
    '2': '..---',
    '3': '...--',
    '4': '....-',
    '5': '.....',
    '6': '-....',
    '7': '--...',
    '8': '---..',
    '9': '----.',
}  # 字典
wl = []  # 生成空列表
print ("初始化完成")
plaintext = str.upper(raw_input("输入明文："))  # 将输入转为字符串，去小写
for char in plaintext:  # 以下遍历plaintext中包含的所有单个成分
    wl.append(code_dict.get(char))  # 从字典中返回上述元素对应指定键的值，并加入列表wl
nwl = " "  # 定义nwl为“ ”
print nwl.join(wl)  # 将列表wl中的元素用nwl的值连接，并输出
print ("Done.")
